release/TestData/Drexyia.WebSvc.Wsdl.Tests/test-union-type-response.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <TEST_UNION xmlns="http://tempuri.org/TestUnionTypeResponse">
      <UnionDetailResponse>
        <UnionDetail>
          <Union>
            <UnionVar>string</UnionVar>
          </Union>
        </UnionDetail>
      </UnionDetailResponse>
    </TEST_UNION>
  </soap:Body>
</soap:Envelope>